app/controllers/repositories_controller.rb

SELECT "repositories".* FROM "repositories"
---
  def index
    @repositories = Repository.all

INSERT INTO "repositories" ("html_url", "description", "stargazers_count", "language", "watchers_count", "forks", "created_at", "updated_at", "full_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @repository = Repository.upsert_all(repository_params)

DELETE FROM "repositories" WHERE "repositories"."id" = ?  [["id", 2]]
---
  def destroy
    @repository.destroy

SELECT "repositories".* FROM "repositories" WHERE "repositories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_repository
      @repository = Repository.find(params[:id])